I don't think the problem is with my code, after importing the MVE resource, the vendor_config part should be visible in the state file.

Before importing MVE:
`
# module.megaport_mve.megaport_mve.mve will be created
  + resource "megaport_mve" "mve" {
      + admin_locked           = (known after apply)
      + attribute_tags         = (known after apply)
      + buyout_port            = (known after apply)
      + cancelable             = (known after apply)
      + company_name           = (known after apply)
      + company_uid            = (known after apply)
      + contract_end_date      = (known after apply)
      + contract_start_date    = (known after apply)
      + contract_term_months   = 24
      + cost_centre            = (known after apply)
      + create_date            = (known after apply)
      + created_by             = (known after apply)
      + diversity_zone         = (known after apply)
      + last_updated           = (known after apply)
      + live_date              = (known after apply)
      + location_id            = 67
      + locked                 = (known after apply)
      + market                 = (known after apply)
      + marketplace_visibility = (known after apply)
      + mve_size               = (known after apply)
      + product_id             = (known after apply)
      + product_name           = "IONA-DC4-MVEUS2"
      + product_type           = (known after apply)
      + product_uid            = (known after apply)
      + provisioning_status    = (known after apply)
      + secondary_name         = (known after apply)
      + terminate_date         = (known after apply)
      + usage_algorithm        = (known after apply)
      + vendor                 = (known after apply)
      + vendor_config          = {
          + image_id     = 204449
          + product_size = "MEDIUM"
          + vendor       = "CISCO"
        }
      + virtual                = (known after apply)
      + vnics                  = [
          + {
              + description = "Data Plane"
            },
          + {
              + description = "Azure connection"
            },
          + {
              + description = "AWS connection"
            },
          + {
              + description = "IONA-DC4-MVEUS2/iBGP"
            },
          + {
              + description = "Spare interface"
            },
        ]
      + vxc_auto_approval      = (known after apply)
      + vxc_permitted          = (known after apply)
    }
`

After imported:
`
# module.megaport_mve.megaport_mve.mve will be updated in-place
  ~ resource "megaport_mve" "mve" {
      ~ contract_start_date    = "Thursday, 18-Jul-24 17:05:04 CEST" -> (known after apply)
      ~ cost_centre            = null -> (known after apply)
      + last_updated           = (known after apply)
      ~ live_date              = "Thursday, 18-Jul-24 17:05:04 CEST" -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ terminate_date         = null -> (known after apply)
      + vendor_config          = {
          + image_id     = 204449
          + product_size = "MEDIUM"
          + vendor       = "CISCO"
        }
        # (27 unchanged attributes hidden)
    }
`

Statefile:
`
resource "megaport_mve" "mve" {
    admin_locked           = false
    attribute_tags         = {}
    buyout_port            = false
    cancelable             = true
    company_name           = "ION Analytics"
    company_uid            = "8af59047-55ee-4c74-8bd3-b07e18fe55f8"
    contract_end_date      = "Saturday, 18-Jul-26 16:00:00 CEST"
    contract_start_date    = "Thursday, 18-Jul-24 17:05:04 CEST"
    contract_term_months   = 24
    cost_centre            = ""
    create_date            = "Thursday, 18-Jul-24 17:03:27 CEST"
    created_by             = "f81730fd-0009-4fce-9196-1a59f9fbd0eb"
    diversity_zone         = "red"
    live_date              = "Thursday, 18-Jul-24 17:05:04 CEST"
    location_id            = 67
    locked                 = false
    market                 = "US"
    marketplace_visibility = false
    mve_size               = "MEDIUM"
    product_id             = 204449
    product_name           = "IONA-DC4-MVEUS2"
    product_type           = "MVE"
    product_uid            = "d3aa4fc1-ac4c-4f94-a21c-4026614ae131"
    provisioning_status    = "LIVE"
    secondary_name         = ""
    terminate_date         = ""
    usage_algorithm        = "POST_PAID_FIXED"
    vendor                 = "CISCO"
    virtual                = false
    vnics                  = [
        {
            description = "Data Plane"
        },
        {
            description = "Azure connection"
        },
        {
            description = "AWS connection"
        },
        {
            description = "IONA-DC4-MVEUS2/iBGP"
        },
        {
            description = "Spare interface"
        },
    ]
    vxc_auto_approval      = false
    vxc_permitted          = true
}
`